MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0ACAU15R/mcu.h
#define DMA_CR                        (*((volatile uint32_t *)0x40008000))      // Control Register
#define DMA_ES                        (*((volatile uint32_t *)0x40008004))      // Error Status Register
#define DMA_ERQ                       (*((volatile uint32_t *)0x4000800C))      // Enable Request Register
#define DMA_EEI                       (*((volatile uint32_t *)0x40008014))      // Enable Error Interrupt Register
#define DMA_CEEI                      (*((volatile uint32_t *)0x40008018))      // Clear Enable Error Interrupt Register
#define DMA_SEEI                      (*((volatile uint32_t *)0x40008019))      // Set Enable Error Interrupt Register


//*****************************************************************************
//
// External Watchdog Monitor (EWM) registers
//
//*****************************************************************************

#define EWM_CTRL                      (*((volatile uint32_t *)0x40061000))      // Control Register (EWM_CTRL)
#define EWM_SERV                      (*((volatile uint32_t *)0x40061001))      // Service Register (EWM_SERV)
#define EWM_CMPL                      (*((volatile uint32_t *)0x40061002))      // Compare Low Register (EWM_CMPL)
#define EWM_CMPH                      (*((volatile uint32_t *)0x40061003))      // Compare High Register (EWM_CMPH)
#define EWM_CLKCTRL                   (*((volatile uint32_t *)0x40061004))      // Clock Control Register (EWM_CLKCTRL)
#define EWM_CLKPRESCALER              (*((volatile uint32_t *)0x40061005))      // Clock Prescaler Register (EWM_CLKPRESCALER)


//*****************************************************************************
//
// Watchdog Timer (WDOG) registers
//
//*****************************************************************************

#define WDOG_STCTRLH                  (*((volatile uint32_t *)0x40052000))      // Watchdog Status and Control Register High
#define WDOG_STCTRLL                  (*((volatile uint32_t *)0x40052002))      // Watchdog Status and Control Register Low
#define WDOG_TOVALH                   (*((volatile uint32_t *)0x40052004))      // Watchdog Time-out Value Register High
#define WDOG_TOVALL                   (*((volatile uint32_t *)0x40052006))      // Watchdog Time-out Value Register Low
#define WDOG_WINH                     (*((volatile uint32_t *)0x40052008))      // Watchdog Window Register High
#define WDOG_WINL                     (*((volatile uint32_t *)0x4005200A))      // Watchdog Window Register Low
#define WDOG_REFRESH                  (*((volatile uint32_t *)0x4005200C))      // Watchdog Refresh register
#define WDOG_UNLOCK                   (*((volatile uint32_t *)0x4005200E))      // Watchdog Unlock register
#define WDOG_TMROUTH                  (*((volatile uint32_t *)0x40052010))      // Watchdog Timer Output Register High
#define WDOG_TMROUTL                  (*((volatile uint32_t *)0x40052012))      // Watchdog Timer Output Register Low
#define WDOG_RSTCNT                   (*((volatile uint32_t *)0x40052014))      // Watchdog Reset Count register
#define WDOG_PRESC                    (*((volatile uint32_t *)0x40052016))      // Watchdog Prescaler register


//*****************************************************************************
//
// Multipurpose Clock Generator (MCG) registers
//
//*****************************************************************************

#define MCG_C1                        (*((volatile uint32_t *)0x40064000))      // MCG Control 1 Register
#define MCG_C2                        (*((volatile uint32_t *)0x40064001))      // MCG Control 2 Register
#define MCG_C3                        (*((volatile uint32_t *)0x40064002))      // MCG Control 3 Register
#define MCG_C4                        (*((volatile uint32_t *)0x40064003))      // MCG Control 4 Register
#define MCG_C5                        (*((volatile uint32_t *)0x40064004))      // MCG Control 5 Register
#define MCG_C6                        (*((volatile uint32_t *)0x40064005))      // MCG Control 6 Register
#define MCG_S                         (*((volatile uint32_t *)0x40064006))      // MCG Status Register
#define MCG_SC                        (*((volatile uint32_t *)0x40064008))      // MCG Status and Control Register
#define MCG_ATCVH                     (*((volatile uint32_t *)0x4006400A))      // MCG Auto Trim Compare Value High Register
#define MCG_ATCVL                     (*((volatile uint32_t *)0x4006400B))      // MCG Auto Trim Compare Value Low Register
#define MCG_C7                        (*((volatile uint32_t *)0x4006400C))      // MCG Control 7 Register
#define MCG_C8                        (*((volatile uint32_t *)0x4006400D))      // MCG Control 8 Register
#define MCG_C9                        (*((volatile uint32_t *)0x4006400E))      // MCG Control 9 Register
#define MCG_C11                       (*((volatile uint32_t *)0x40064010))      // MCG Control 11 Register
#define MCG_C12                       (*((volatile uint32_t *)0x40064011))      // MCG Control 12 Register
#define MCG_S2                        (*((volatile uint32_t *)0x40064012))      // MCG Status 2 Register
#define MCG_T3                        (*((volatile uint32_t *)0x40064013))      // MCG Test 3 Register


//*****************************************************************************
//
// Oscillator (OSC) registers
//
//*****************************************************************************

#define OSC_CR                        (*((volatile uint32_t *)0x0))      // OSC Control Register
#define OSC_OSC_DIV                   (*((volatile uint32_t *)0x2))      // OSC Clock divider register


//*****************************************************************************
//
// Local Memory Controller registers
//
//*****************************************************************************

#define LMEM_PCCCR                    (*((volatile uint32_t *)0xE0082000))      // Cache control register (LMEM_PCCCR)
#define LMEM_PCCLCR                   (*((volatile uint32_t *)0xE0082004))      // Cache line control register (LMEM_PCCLCR)
#define LMEM_PCCSAR                   (*((volatile uint32_t *)0xE0082008))      // Cache search address register (LMEM_PCCSAR)
#define LMEM_PCCCVR                   (*((volatile uint32_t *)0xE008200C))      // Cache read/write value register (LMEM_PCCCVR)
#define LMEM_PCCRMR                   (*((volatile uint32_t *)0xE0082020))      // Cache regions mode register (LMEM_PCCRMR)
#define LMEM_PSCCR                    (*((volatile uint32_t *)0xE0082800))      // Cache control register (LMEM_PSCCR)
#define LMEM_PSCLCR                   (*((volatile uint32_t *)0xE0082804))      // Cache line control register (LMEM_PSCLCR)
#define LMEM_PSCSAR                   (*((volatile uint32_t *)0xE0082808))      // Cache search address register (LMEM_PSCSAR)
#define LMEM_PSCCVR                   (*((volatile uint32_t *)0xE008280C))      // Cache read/write value register (LMEM_PSCCVR)
#define LMEM_PSCRMR                   (*((volatile uint32_t *)0xE0082820))      // Cache regions mode register (LMEM_PSCRMR)


//*****************************************************************************
//
// Flash Memory Controller (FMC) registers
//
//*****************************************************************************

#define FMC_PFAPR                     (*((volatile uint32_t *)0x0))      // Flash Access Protection Register
#define FMC_PFB01CR                   (*((volatile uint32_t *)0x4))      // Flash Bank 0-1 Control Register
#define FMC_PFB23CR                   (*((volatile uint32_t *)0x8))      // Flash Bank 2-3 Control Register
#define FMC_TAGVDW0S0                 (*((volatile uint32_t *)0x100))      // Cache Tag Storage
#define FMC_TAGVDW0S1                 (*((volatile uint32_t *)0x104))      // Cache Tag Storage
#define FMC_TAGVDW0S2                 (*((volatile uint32_t *)0x108))      // Cache Tag Storage


//*****************************************************************************
//
// Synchronous DRAM Controller Module (SDRAM) registers
//
//*****************************************************************************

