MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0ACAU15R/mcu.h
#define POL1                          0x00000002      // Channel 1 Polarity
#define POL0                          0x00000001      // Channel 0 Polarity


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_FILTER register.
//
//*****************************************************************************

#define CH1FVAL                       0x00000780      // Channel 1 Filter Value
#define CH0FVAL                       0x00000078      // Channel 0 Filter Value


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_QDCTRL register.
//
//*****************************************************************************

#define QUADMODE                      0x00000008      // Quadrature Decoder Mode
#define QUADIR                        0x00000004      // Counter Direction in Quadrature Decode Mode
#define TOFDIR                        0x00000002      // Indicates if the TOF bit was set on the top or the bottom of counting
#define QUADEN                        0x00000001      // Enables the quadrature decoder mode


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_CONF register.
//
//*****************************************************************************

#define TRGSEL                        0x78000000      // Trigger Select
#define TRGSRC                        0x00800000      // Trigger Source
#define TRGPOL                        0x00400000      // Trigger Polarity
#define CROT                          0x00200000      // Counter Reset on Trigger
#define CSOT                          0x00100000      // Counter Start on Trigger
#define CPOT                          0x00080000      // Counter Pause on Trigger
#define CSOO                          0x00040000      // Counter Stop on Overflow
#define GTBEEN                        0x00020000      // Global Time Base Enable
#define GTBSYNC                       0x00010000      // Global Time Base Synchronization
#define DBGMODE                       0x00018000      // Debug Mode
#define DOZEEN                        0x00002000      // Doze Enable ::


//*****************************************************************************
//
// The following are defines for the bit fields in the LPTMRx_PSR register.
//
//*****************************************************************************

#define PRESCALE                      0x000003C0      // Configures the size of the Prescaler in Time Counter mode or width of the glitch filter in Pulse Counter mode
#define PBYP                          0x00000004      // Prescaler Bypass
#define PCS                           0x00000006      // Prescaler Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the LPTMRx_CMR register.
//
//*****************************************************************************

#define COMPARE                       0x7FFF8000      // Compare Value


//*****************************************************************************
//
// The following are defines for the bit fields in the LPTMRx_CNR register.
//
//*****************************************************************************

#define COUNTER                       0x7FFF8000      // Counter Value


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_CGH1 register.
//
//*****************************************************************************

#define PH                            0x00007F80      // Primary Carrier High Time Data Value


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_CGL1 register.
//
//*****************************************************************************

#define PL                            0x00007F80      // Primary Carrier Low Time Data Value


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_CGH2 register.
//
//*****************************************************************************

#define SH                            0x00007F80      // Secondary Carrier High Time Data Value


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_CGL2 register.
//
//*****************************************************************************

#define SL                            0x00007F80      // Secondary Carrier Low Time Data Value


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_OC register.
//
//*****************************************************************************

#define IROL                          0x00000080      // IRO Latch Control
#define CMTPOL                        0x00000040      // CMT Output Polarity
#define IROPEN                        0x00000020      // IRO Pin Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_MSC register.
//
//*****************************************************************************

#define EOCF                          0x00000080      // End Of Cycle Status Flag
#define CMTDIV                        0x000000C0      // CMT Clock Divide Prescaler
#define EXSPC                         0x00000010      // Extended Space Enable
#define BASE                          0x00000008      // Baseband Enable
#define FSK                           0x00000004      // FSK Mode Select
#define EOCIE                         0x00000002      // End of Cycle Interrupt Enable
#define MCGEN                         0x00000001      // Modulator and Carrier Generator Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_CMD1 register.
//
//*****************************************************************************

#define MB[7:0]                       0x00007F80      // MB[7:0]


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_CMD2 register.
//
//*****************************************************************************

